galleria/app/controllers/images_controller.rb

  def index
    @images = Image.all
---
SELECT * FROM "images"

  def show
    @image = Image.find(params[:id])
---
SELECT * FROM "images" WHERE ("images"."id" = 1)

  def create
    @image = Image.new(params[:image])
    @image =Image.create(params[:user])
---
INSERT INTO "images" ("updated_at", "type", "file_size", "uploader", "image_name", "created_at") VALUES('2010-01-29 23:01:33', NULL, NULL, NULL, NULL, '2010-01-29 23:01:33')

  def destroy
    @image = Image.find(params[:id])
---
SELECT * FROM "images" WHERE ("images"."id" = 1)