kuvalauta2/app/controllers/images_controller.rb

  def index
    @images = Image.all
---
SELECT * FROM "images"

  def show
    @image = Image.find(params[:id])
---
SELECT * FROM "images" WHERE ("images"."id" = 1)

  def edit
    @image = Image.find(params[:id])
---
SELECT * FROM "images" WHERE ("images"."id" = 1)

  def create
    @image = Image.create(params[:image])
---
INSERT INTO "images" ("content_type", "name", "updated_at", "file_name", "uploaded", "file_size", "uploader", "created_at") VALUES('', 'hei', '2010-02-13 09:25:33', '', '2010-02-13 09:24:00', NULL, 'panttiantti', '2010-02-13 09:25:33')

  def update
    @image = Image.find(params[:id])

    respond_to do |format|
      if @image.update_attributes(params[:image])
---
SELECT * FROM "images" WHERE ("images"."id" = 2)
UPDATE "images" SET "name" = 'hui' WHERE "id" = 3

  def destroy
    @image = Image.find(params[:id])
    @image.destroy
---
SELECT * FROM "images" WHERE ("images"."id" = 1)
DELETE FROM "images" WHERE "id" = 1