kuvalauta2/app/controllers/kuvalauta_controller.rb

SELECT * FROM "images" ORDER BY name
---
  def index
    @images = Image.find_all_images

INSERT INTO "comments" ("updated_at", "user_id", "comment", "posted", "image_id", "created_at") VALUES('2010-02-15 11:20:24', NULL, '', NULL, 2, '2010-02-15 11:20:24')
SELECT * FROM "images" WHERE ("images"."id" = 2)
---
  def comment
    Image.find(params[:id]).comments.create(params[:comment])