kuvalauta2/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "pasword", "updated_at", "email", "created_at") VALUES('pantti', 'antti', '2010-02-12 18:29:40', 'hannes', '2010-02-12 18:29:40')