app/controllers/users_controller.rb

  def show
    @user = User.find params[:id]
---
SELECT * FROM "users" WHERE ("users"."id" = 7) LIMIT 1

  def edit
    @user = User.find session[:user_id]

    if request.post?
      if @user.update_attributes params[:user]
---
SELECT * FROM "users" WHERE ("users"."id" = '--- :user_id
UPDATE "users" SET "pasword" = 'hei', "name" = 'hei', "updated_at" = '2010-02-18 20:32:51' WHERE "id" = 7

  def create
    @user = User.new params[:user]

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "pasword", "updated_at", "email", "created_at") VALUES('pantti', 'antti', '2010-02-12 18:29:40', 'hannes', '2010-02-12 18:29:40')

  def destroy
    @user = User.find params[:id]
    @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
DELETE FROM "users" WHERE "id" = 1